# 제곱 함수와 n 제곱 함수 만들기

In [46]:
import pandas as pd

In [47]:
def my_sq(x):
    return x ** 2

In [48]:
my_sq(4)

16

In [49]:
def my_exp(x,n):
    return x ** n

In [50]:
my_exp(2,4)

16

# 시리즈와 apply 메서드

In [51]:
df=pd.DataFrame({'a':[10,20,30],'b':[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [52]:
df['a']**2

0    100
1    400
2    900
Name: a, dtype: int64

In [53]:
sq=df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [54]:
ex=df['a'].apply(my_exp,n=2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

# 데이터 프레임과 apply 메서드

In [55]:
df=pd.DataFrame({'a':[10,20,30],'b':[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [56]:
def print_me(x):
    print(x)

In [57]:
df.apply(print_me,axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [58]:
df.apply(print_me,axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [59]:
df['a'].apply(print_me)

10
20
30

0    None
1    None
2    None
Name: a, dtype: object

In [60]:
df['b'].apply(print_me)

20
30
40

0    None
1    None
2    None
Name: b, dtype: object

In [61]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [62]:
df['b']

0    20
1    30
2    40
Name: b, dtype: int64

In [63]:
def avg_3(x,y,z):
    return (x+y+z)/3

In [64]:
df.apply(avg_3)

TypeError: avg_3() missing 2 required positional arguments: 'y' and 'z'

In [65]:
def avg_3_apply(col):
    x=col[0]
    y=col[1]
    z=col[2]
    return (x+y+z)/3

In [66]:
df.apply(avg_3_apply)

a    20.0
b    30.0
dtype: float64

In [67]:
def avg_3_apply(col):
    sum=0
    for item in col:
        sum += item
    return sum/df.shape[0]

In [68]:
df.apply(avg_3_apply,axis=0)

a    20.0
b    30.0
dtype: float64

In [69]:
df.apply(avg_3_apply,axis=1)

0    10.000000
1    16.666667
2    23.333333
dtype: float64

In [70]:
def avg_2_apply(row):
    sum=0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [71]:
df.apply(avg_2_apply,axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [72]:
df.apply(avg_3_apply,axis=0)

a    20.0
b    30.0
dtype: float64

In [73]:
df.shape[0]

3

In [74]:
df.shape[1]

2

In [75]:
df.shape

(3, 2)

# 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기 - 열 방향

In [76]:
import seaborn as sns

In [77]:
titanic=sns.load_dataset('titanic')

In [79]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [80]:
import numpy as np

In [81]:
def count_missing(vec):
    null_vec=pd.isnull(vec)
    null_count=np.sum(null_vec)
    return null_count

In [83]:
cmis_col=titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [84]:
def prop_missing(vec):
    num=count_missing(vec)
    dem=vec.size
    return num/dem

In [85]:
pmis_col=titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [87]:
pmis_col=titanic.apply(prop_missing,axis=1)
pmis_col

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [86]:
titanic.size

13365

In [89]:
def prop_complete(vec):
    return 1 - prop_missing(vec)

In [90]:
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

# 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기 - 행 방뱡

In [91]:
cmis_row=titanic.apply(count_missing,axis=1)
pmis_row=titanic.apply(prop_missing,axis=1)
pcom_row=titanic.apply(prop_complete,axis=1)

In [94]:
cmis_row.head

<bound method NDFrame.head of 0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64>

In [95]:
pmis_row.head()

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

In [96]:
pcom_row.head()

0    0.933333
1    1.000000
2    0.933333
3    1.000000
4    0.933333
dtype: float64

In [97]:
titanic['num_missing']=titanic.apply(count_missing,axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [100]:
titanic.loc[titanic['num_missing']>1,:].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2

In [101]:
titanic.loc[titanic.num_missing>1,:].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2